src/Catalogs/цур_Роли/цур_Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_Роли</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.цур_ИнформационныеБазы</owners>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляНовыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляРеквизитовПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеПраваПодчиненных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.цур_СтатусыРоли</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСоставаРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/цур_СтатусыРоли/цур_СтатусыРоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_СтатусыРоли</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Актуальна</name>
  </enumValues>
  <enumValues>
    <name>Устарела</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/цур_Роли/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СгенерироватьРасширение(Команда)

	МассивАктуальныхРолей = ПолучитьАктуальныеРолиНаСервере();

	Если МассивАктуальныхРолей.Количество() = 0 Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Нет ролей со статусом ""Актуальна"".'"));
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("МассивРолей", МассивАктуальныхРолей);
	ОткрытьФорму("Обработка.цур_ГенераторРолей.Форма.Форма", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАктуальныеРолиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Роли.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.цур_Роли КАК Роли
	|ГДЕ
	|	Роли.Статус = &Статус
	|	И НЕ Роли.ЭтоГруппа";
	Запрос.УстановитьПараметр("Статус", Перечисления.цур_СтатусыРоли.Актуальна);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти
